{
    "allowedChars": [1, "list of permitted characters in the password"],
    "minimumLength": [1, "int of the minimum length of the password"],
    "maximumLength": [1, "int of the maximum length of the password"],
    "exactLength": [1, "int of the exact length of the password"],
    "containNumber": 0,
    "containLower": 0,
    "containUpper": 0,
    "containLetter": 0,
    "containSpecial": [1, "a list of characters recognized as special characters"],
    "containTypes": [2, "int of the minimum number of types needed", "a list of characters recognized as special characters"],
    "containBroadTypes": [2, "int of the minimum number of types needed", "a list of characters recognized as special characters"],
    "bannedPasswords": [1, "list of passwords not permitted to be used (case insensitive)"],
    "bannedCaseSensitivePasswords": [1, "list of passwords not permitted to be used (must match case)"],
    "bannedWords": [1, "list of words that cannot be contained by the password (case insensitive)"],
    "bannedCaseSensitiveWords": [1, "list of words that cannot be contained by the password (must match case)"],
    "bannedChar": [1, "list of char that can't appear in the password"],
    "bannedStartChar": [1, "char that cannot be the first character of the password"],
    "bannedEndChar": [1, "char that cannot be the last character of the password"],
    "noRepeated": [1, "int representing the minimum number of repeated characters that is not allowed"],
    "notBadPassword": [0, "this rule matches your password with a list of known bad passwords from an API"],
    "noDictWords": [1, "int representing the minimum length of words in a dictionary API that can be matched"],
    "nondeterministicRule": 0,
    
    
    "comments": [
        "containTypes vs containBroad Types:",
        "containTypes checks for containNumber, containLower, containUpper, and containSpecial (return maximum number of 4).",
        "containBroadTypes checks for containNumber, containLetter, and containSpecial (return maximum number of 3).",
        "2023-11-13: minimumByteLength and maximumByteLength are problematic as we don't have a uniform encoding standard, these rules are deleted."
    ]
}